package code;

/*
 * Цей інтерфейс описує методи для взаємодії фігур, які пов'язані між собою через конкретний медіатор.
 * Медіатор дозволяє фігурам обмінюватися повідомленнями без безпосередньої взаємодії.
 * 
 * @see ConcreteMediator --- клас, що реалізує цей інтерфейс і обробляє взаємодію між фігурами.
 */
public interface iMediator {
	/*
	 * Цей метод прив'язує фігуру типу {@link iShape} до об'єкта медіатора,
	 * щоб вона могла отримувати повідомлення.
	 *  
	 * @param shape Фігура, яку потрібно прив'язати до медіатора. Фігура повинна реалізовувати інтерфейс {@link iShape}
	 */
	void addShape(iShape shape);
	
	/*
	 * Цей метод відв'язує фігуру типу {@link iShape} від об'єкта медіатора,
	 * щоб вона більше не отримувала повідомлення. 
	 * 
	 * @param shape Фігура, яку необхідно відв'язати від медіатора. Фігура повинна реалізовувати інтерфейс {@link iShape}
	 */
	void removeShape(iShape shape);
	
	/*
	 * Цей метод надсилає повідомлення кожній фігурі, яка прив'язана до об'єкта медіатора
	 * 
	 * @param number Число, яке є змістом повідомлення, що буде передано іншим фігурам.
	 * @param shape Представляє фігуру-автора повідомлення. Потрібна для того, щоб медіатор не надсилав 
	 * 				повідомлення фігурі-автору. Фігура повинна реалізовувати інтерфейс {@link iShape}.
	 * @param id Представляє ідентифікатор фігури, яка надсилає повідомлення.
	 */
	void sendMessage(int number, iShape shape, int id); // ... or without id
}
