package code;

import javafx.scene.layout.Pane;

/*
 * Цей інтерфейс описує методи, які повинні бути реалізовані класами конкретних фігур.
 * Конкретні фігури {@see SquareShape} {@see CircleShape} взаємодіють одне з одним через об'єкт медіатора, який
 * реалізує інтерфейс {@link iMediator}
 */
public interface iShape {
	/*
	 * Цей метод рисує фігуру на заданих координатах на панелі.
	 * 
	 * @param x Координата x для визначення розташування вершини фігури (для квадратів) 
     *          або центру кола (для кругів).
     * @param y Координата y для визначення розташування вершини фігури (для квадратів) 
     *          або центру кола (для кругів).
     * @param pane Панель {@link Pane}, на якій буде малюватися фігура.
	 */
	void draw(int x, int y, Pane pane);
	
	/*
	 * Надсилає повідомлення через медіатор, який реалізує інтерфейс {@link iMediator}.
     * Повідомленням є ціле число, яке на 1 більше за ідентифікатор фігури, що ініціює повідомлення.
     * 
     * @see iMediator#sendMessage(int, iShape, int)
     */
	void sendMessage();
	
	/*
	 * Надсилає повідомлення через медіатора, який реалізує інтерфейс {@link iMediator}. 
     * Повідомленням є ціле число, яке на 1 менше за ідентифікатор фігури, що ініціює повідомлення.
     * 
     * @see iMediator#sendMessage(int, iShape, int)
	 */
	void sendMessageReverse();
	
	/*
	 * Приймає повідомлення, яке є цілим числом. Якщо число з повідомлення збігається з 
     * номером ідентифікатора цієї фігури, то вона отримає тимчасову анімацію підсвічування
     * та сповістить про це в консолі.
     * 
     * @param number Число-повідомлення, яке фігура приймає.
	 */
	void receiveMessage(int number);
}
